In [5]:
# - Pandas is a Python library that is used for data manipulation as MS Excel.
# - Pandas stands for Panel Data.
# - In Pandas we work with tabular data.
# - In Pandas we work with two objects, 1- Series and 2- Data frame.
# - We have to import Pandas first to use it.

# Importing Pandas

In [8]:
import pandas as pd

# Version

In [11]:
pd.__version__

'1.5.3'

# Series

In [16]:
# - A series is like a 1-D array staructure.
# - A series shows the values and their indexes too.
# - It can be treated as a column from a table (Excel table)
# - Note- A series does not have any header.

# Creating a series

In [19]:
# pd.Series(list/tuple/array/dictionary)

### Using list/tuple/arrays

In [22]:
lst=[10,20,30,40,50,60,70,80]
print(lst,type(lst))

[10, 20, 30, 40, 50, 60, 70, 80] <class 'list'>

In [24]:
nums=pd.Series(lst)

In [28]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [30]:
t=(10,20,30,40,50,60,70,80)
print(t,type(t))

(10, 20, 30, 40, 50, 60, 70, 80) <class 'tuple'>

In [34]:
nums=pd.Series(t)

In [42]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [38]:
type(nums)

pandas.core.series.Series

In [46]:
import numpy as np

In [48]:
arr=np.array([10,20,30,40,50])
arr

array([10, 20, 30, 40, 50])

In [52]:
nums=pd.Series(arr)

In [54]:
nums

0    10
1    20
2    30
3    40
4    50
dtype: int32

### Using a dictionary

In [57]:
# - When we create a series using a dictionary then the keys becom the indexes.
# - The values become the values

In [61]:
d={'Name':'Jayanth','Age':25,'City':'Pune','Salary':88000}
print(d,type(d))

{'Name': 'Jayanth', 'Age': 25, 'City': 'Pune', 'Salary': 88000} <class 'dict'>

In [65]:
emp=pd.Series(d)

In [67]:
emp

Name      Jayanth
Age            25
City         Pune
Salary      88000
dtype: object

In [75]:
# pd.Series(frozenset({10,20,30,40,50}))

In [79]:
pd.Series(range(10,21))

0     10
1     11
2     12
3     13
4     14
5     15
6     16
7     17
8     18
9     19
10    20
dtype: int64

# Attributes on a series

### size

In [83]:
# - It returns the number of elememts in a series.

In [85]:
nums

0    10
1    20
2    30
3    40
4    50
dtype: int32

In [87]:
nums.size

5

In [89]:
emp

Name      Jayanth
Age            25
City         Pune
Salary      88000
dtype: object

In [91]:
emp.size

4

In [93]:
len(nums)

5

In [95]:
len(emp)

4

### dtype

In [126]:
# - It returns the datatype of the elements a series contains.
# - A series also follows upcasting method as arrays.
# - A series has numeric types and object type (non-numeric)

In [100]:
# ser.dtype

In [102]:
nums=pd.Series([10,20,30,40,50,60,70,80])

In [104]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [106]:
nums.dtype

dtype('int64')

In [110]:
nums=pd.Series([10,20,30,40.66,50,60,70,80])

In [112]:
nums

0    10.00
1    20.00
2    30.00
3    40.66
4    50.00
5    60.00
6    70.00
7    80.00
dtype: float64

In [114]:
nums.dtype

dtype('float64')

In [122]:
nums=pd.Series([10,20.55,30,40,50+6j,60,70,80])

In [124]:
nums

0    10.00+0.00j
1    20.55+0.00j
2    30.00+0.00j
3    40.00+0.00j
4    50.00+6.00j
5    60.00+0.00j
6    70.00+0.00j
7    80.00+0.00j
dtype: complex128

In [120]:
nums.dtype

dtype('complex128')

In [128]:
nums=pd.Series([10,20,30,'40',50,60,70,80])

In [130]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: object

### shape

In [133]:
# - In case of a series shape returns a tuple of single element that represents the number of elements.

In [135]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: object

In [137]:
nums.shape

(8,)

### ndim

In [140]:
# - It returns the dimension.
# - A series is a one dimesional structure.

In [142]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: object

In [144]:
nums.ndim

1

### name

In [147]:
# - We can assign or change a name of a series.

In [149]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: object

In [151]:
nums.name='Numbers'

In [153]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Numbers, dtype: object

In [155]:
nums.name

'Numbers'

In [157]:
nums.name='Digits'

In [159]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Digits, dtype: object

### index

In [166]:
# - In case of implicit indexes it returns the RangeIndex object that contains the start,stop and step
# - In case of explicit indexes it return the Index object that contains a list of the indexes.

# - Implicit Indexes (Python defined)
# - Explicit Indexes (User defined)

In [168]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Digits, dtype: object

In [170]:
nums.index

RangeIndex(start=0, stop=8, step=1)

In [172]:
emp

Name      Jayanth
Age            25
City         Pune
Salary      88000
dtype: object

In [174]:
emp.index

Index(['Name', 'Age', 'City', 'Salary'], dtype='object')

### values

In [177]:
# - It returns an array that contains the values from a series.

In [179]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Digits, dtype: object

In [181]:
nums.values

array([10, 20, 30, '40', 50, 60, 70, 80], dtype=object)

In [183]:
emp

Name      Jayanth
Age            25
City         Pune
Salary      88000
dtype: object

In [185]:
emp.values

array(['Jayanth', 25, 'Pune', 88000], dtype=object)

# Inexing and Slicing of a series

### Indexing

In [189]:
# - A series may have implicit (default) indexes and the user defined indexes.

In [195]:
names=pd.Series(['Aditya', 'Pallavi', 'Jayanth', 'Deepak', 'Nidhi', 'Dhruv', 'Megha'])

In [197]:
names

0     Aditya
1    Pallavi
2    Jayanth
3     Deepak
4      Nidhi
5      Dhruv
6      Megha
dtype: object

In [201]:
# series.index=list of user defined indexes

In [207]:
ind=['emp_'+str(i) for i in range(1,8)]
ind

['emp_1', 'emp_2', 'emp_3', 'emp_4', 'emp_5', 'emp_6', 'emp_7']

In [211]:
names.index=ind

In [213]:
names

emp_1     Aditya
emp_2    Pallavi
emp_3    Jayanth
emp_4     Deepak
emp_5      Nidhi
emp_6      Dhruv
emp_7      Megha
dtype: object

In [215]:
names.index

Index(['emp_1', 'emp_2', 'emp_3', 'emp_4', 'emp_5', 'emp_6', 'emp_7'], dtype='object')

In [219]:
names=pd.Series(['Aditya', 'Pallavi', 'Jayanth', 'Deepak', 'Nidhi', 'Dhruv', 'Megha'],index=list('abcdefg'))

In [217]:
list('abcdefg')

['a', 'b', 'c', 'd', 'e', 'f', 'g']

In [221]:
names

a     Aditya
b    Pallavi
c    Jayanth
d     Deepak
e      Nidhi
f      Dhruv
g      Megha
dtype: object

# Accessing the elements using the implicit and the explicit indexes

In [241]:
# ser.iloc[implicit_index]
# ser.loc[explicit_index]

In [243]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Digits, dtype: object

In [245]:
# First element
nums.iloc[0]

10

In [247]:
nums.iloc[-8]

10

In [251]:
-len(nums)

-8

In [253]:
nums.iloc[-len(nums)]

10

In [255]:
names

a     Aditya
b    Pallavi
c    Jayanth
d     Deepak
e      Nidhi
f      Dhruv
g      Megha
dtype: object

In [257]:
# Fisrt element
names.iloc[0]

'Aditya'

In [259]:
names.loc['a']

'Aditya'

In [270]:
# Give the details of d
names.loc['d']

'Deepak'

In [272]:
# Last element

In [274]:
names.iloc[-1]

'Megha'

In [278]:
names.iloc[6]

'Megha'

In [280]:
len(names)-1

6

In [282]:
names.iloc[len(names)-1]

'Megha'

In [284]:
names.loc['g']

'Megha'

### Slicing

In [314]:
# ser.iloc[start:stop:step]  (implicit) -> stop is excluded
# ser.loc[start:stop:step]  (explicit) -> stop is included

In [292]:
nums

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
Name: Digits, dtype: object

In [294]:
# First three elements

In [300]:
nums.iloc[0:3]

0    10
1    20
2    30
Name: Digits, dtype: object

In [302]:
nums.iloc[0:3:1]

0    10
1    20
2    30
Name: Digits, dtype: object

In [304]:
# Reverse the series

In [306]:
nums.iloc[::-1]

7    80
6    70
5    60
4    50
3    40
2    30
1    20
0    10
Name: Digits, dtype: object

In [308]:
names

a     Aditya
b    Pallavi
c    Jayanth
d     Deepak
e      Nidhi
f      Dhruv
g      Megha
dtype: object

In [310]:
# First three elements

In [312]:
names.iloc[0:3]

a     Aditya
b    Pallavi
c    Jayanth
dtype: object

In [320]:
names.loc['a':'c']

a     Aditya
b    Pallavi
c    Jayanth
dtype: object

In [322]:
# Aletrnate names

In [326]:
names.iloc[::2]

a     Aditya
c    Jayanth
e      Nidhi
g      Megha
dtype: object

In [328]:
names.loc[::2]

a     Aditya
c    Jayanth
e      Nidhi
g      Megha
dtype: object

In [330]:
names.loc['a':'g':2]

a     Aditya
c    Jayanth
e      Nidhi
g      Megha
dtype: object

In [337]:
# Reverse the series

In [335]:
names.iloc[::-1]

g      Megha
f      Dhruv
e      Nidhi
d     Deepak
c    Jayanth
b    Pallavi
a     Aditya
dtype: object

In [339]:
names.loc[::-1]

g      Megha
f      Dhruv
e      Nidhi
d     Deepak
c    Jayanth
b    Pallavi
a     Aditya
dtype: object

In [343]:
names.loc['g':'a':-1]

g      Megha
f      Dhruv
e      Nidhi
d     Deepak
c    Jayanth
b    Pallavi
a     Aditya
dtype: object

# Modifying an element in a series

In [346]:
# - An elements can be modified using the index only.

In [348]:
# In names the first name shoukd be 'Amit'

In [350]:
names

a     Aditya
b    Pallavi
c    Jayanth
d     Deepak
e      Nidhi
f      Dhruv
g      Megha
dtype: object

In [354]:
names.iloc[0]='Amit'

In [356]:
names

a       Amit
b    Pallavi
c    Jayanth
d     Deepak
e      Nidhi
f      Dhruv
g      Megha
dtype: object

In [358]:
# The name should be Abhishek at d index.

In [362]:
names.loc['d']='Abhishek'

In [364]:
names

a        Amit
b     Pallavi
c     Jayanth
d    Abhishek
e       Nidhi
f       Dhruv
g       Megha
dtype: object

In [366]:
# Replace Dhruv with Debolina

In [368]:
names=='Dhruv'

a    False
b    False
c    False
d    False
e    False
f     True
g    False
dtype: bool

In [372]:
names[names=='Dhruv']='Debolina'

In [374]:
names

a        Amit
b     Pallavi
c     Jayanth
d    Abhishek
e       Nidhi
f    Debolina
g       Megha
dtype: object

In [384]:
ind=np.array(names.index)
ind

array(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype=object)

In [390]:
ind[ind=='d']='k'

In [392]:
ind

array(['a', 'b', 'c', 'k', 'e', 'f', 'g'], dtype=object)

In [396]:
names.index=ind

In [398]:
names

a        Amit
b     Pallavi
c     Jayanth
k    Abhishek
e       Nidhi
f    Debolina
g       Megha
dtype: object

# Sorting of a series

In [401]:
# - We can sort the values
# - We can sort the indexes also

In [403]:
# ser.sort_values()
# ser.sort_index()

In [405]:
names

a        Amit
b     Pallavi
c     Jayanth
k    Abhishek
e       Nidhi
f    Debolina
g       Megha
dtype: object

In [407]:
names.sort_values()

k    Abhishek
a        Amit
f    Debolina
c     Jayanth
g       Megha
e       Nidhi
b     Pallavi
dtype: object

In [409]:
names.sort_values(ascending=False)

b     Pallavi
e       Nidhi
g       Megha
c     Jayanth
f    Debolina
a        Amit
k    Abhishek
dtype: object

In [411]:
names

a        Amit
b     Pallavi
c     Jayanth
k    Abhishek
e       Nidhi
f    Debolina
g       Megha
dtype: object

In [413]:
names.sort_values(ascending=False,inplace=True)

In [415]:
names

b     Pallavi
e       Nidhi
g       Megha
c     Jayanth
f    Debolina
a        Amit
k    Abhishek
dtype: object

In [417]:
names.sort_index()

a        Amit
b     Pallavi
c     Jayanth
e       Nidhi
f    Debolina
g       Megha
k    Abhishek
dtype: object

In [419]:
names

b     Pallavi
e       Nidhi
g       Megha
c     Jayanth
f    Debolina
a        Amit
k    Abhishek
dtype: object

In [421]:
names.sort_index(ascending=False)

k    Abhishek
g       Megha
f    Debolina
e       Nidhi
c     Jayanth
b     Pallavi
a        Amit
dtype: object

In [423]:
names

b     Pallavi
e       Nidhi
g       Megha
c     Jayanth
f    Debolina
a        Amit
k    Abhishek
dtype: object

In [425]:
# names=names.sort_index(ascending=False)
names.sort_index(ascending=False,inplace=True)

In [427]:
names

k    Abhishek
g       Megha
f    Debolina
e       Nidhi
c     Jayanth
b     Pallavi
a        Amit
dtype: object

# Dataframe

In [433]:
# - A dataframe is like a 2-D array structure.
# - It can be treated as a table from Excel.
# - A dataframe is a collection of series.
# - A dataframe has column headers.

# Creating a dataframe

In [445]:
# pd.DataFrame(list/tuple/dict/arr/series)

### Using a 2-D list or 2-D arrays

In [437]:
name=['Jayanth', 'Suresh', 'Megha', 'Deepak', 'Pallavi', 'Rahul', 'Dhruv', 'Nidhi']
age=[24,26,27,21,28,25,21,26]
city=['Pune', 'Bangalore', 'Delhi', 'Hyderabad', 'Chennai','Noida', 'Gurugram', 'Dehradun']
codes=[111,112,113,114,115,116,117,118]

In [443]:
data=[name,codes,age,city]
print(data)

[['Jayanth', 'Suresh', 'Megha', 'Deepak', 'Pallavi', 'Rahul', 'Dhruv', 'Nidhi'], [111, 112, 113, 114, 115, 116, 117, 118], [24, 26, 27, 21, 28, 25, 21, 26], ['Pune', 'Bangalore', 'Delhi', 'Hyderabad', 'Chennai', 'Noida', 'Gurugram', 'Dehradun']]

In [447]:
pd.DataFrame(data)

         0          1      2          3        4      5         6         7
0  Jayanth     Suresh  Megha     Deepak  Pallavi  Rahul     Dhruv     Nidhi
1      111        112    113        114      115    116       117       118
2       24         26     27         21       28     25        21        26
3     Pune  Bangalore  Delhi  Hyderabad  Chennai  Noida  Gurugram  Dehradun

In [451]:
df=pd.DataFrame(data).T
df

         0    1   2          3
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [453]:
df.columns=['Name','ID','Age','City']

In [455]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [459]:
data=[['Jayanth',111,24,'Pune'],
['Suresh',112,26,'Bangalore'],
['Megha',113,27,'Delhi'],
['Deepak',114,21,'Hyderabad']]

In [465]:
df=pd.DataFrame(data,columns=['Name','ID','Age','City'])
df

      Name   ID  Age       City
0  Jayanth  111   24       Pune
1   Suresh  112   26  Bangalore
2    Megha  113   27      Delhi
3   Deepak  114   21  Hyderabad

### Using series

In [468]:
name=pd.Series(['Jayanth', 'Suresh', 'Megha', 'Deepak', 'Pallavi', 'Rahul', 'Dhruv', 'Nidhi'])
age=pd.Series([24,26,27,21,28,25,21,26])
city=pd.Series(['Pune', 'Bangalore', 'Delhi', 'Hyderabad', 'Chennai','Noida', 'Gurugram', 'Dehradun'])
codes=pd.Series([111,112,113,114,115,116,117,118])

In [512]:
name

0    Jayanth
1     Suresh
2      Megha
3     Deepak
4    Pallavi
5      Rahul
6      Dhruv
7      Nidhi
dtype: object

In [472]:
codes

0    111
1    112
2    113
3    114
4    115
5    116
6    117
7    118
dtype: int64

In [474]:
age

0    24
1    26
2    27
3    21
4    28
5    25
6    21
7    26
dtype: int64

In [476]:
city

0         Pune
1    Bangalore
2        Delhi
3    Hyderabad
4      Chennai
5        Noida
6     Gurugram
7     Dehradun
dtype: object

In [480]:
data=[name,codes,age,city]
print(data)

[0    Jayanth
1     Suresh
2      Megha
3     Deepak
4    Pallavi
5      Rahul
6      Dhruv
7      Nidhi
dtype: object, 0    111
1    112
2    113
3    114
4    115
5    116
6    117
7    118
dtype: int64, 0    24
1    26
2    27
3    21
4    28
5    25
6    21
7    26
dtype: int64, 0         Pune
1    Bangalore
2        Delhi
3    Hyderabad
4      Chennai
5        Noida
6     Gurugram
7     Dehradun
dtype: object]

In [482]:
pd.DataFrame(data)

         0          1      2          3        4      5         6         7
0  Jayanth     Suresh  Megha     Deepak  Pallavi  Rahul     Dhruv     Nidhi
1      111        112    113        114      115    116       117       118
2       24         26     27         21       28     25        21        26
3     Pune  Bangalore  Delhi  Hyderabad  Chennai  Noida  Gurugram  Dehradun

In [486]:
df=pd.DataFrame(data).T
df

         0    1   2          3
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [488]:
df.columns=['Name','ID','Age','City']

In [490]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [514]:
name.name='Name'
codes.name='ID'
age.name='Age'
city.name='City'

In [516]:
name

0    Jayanth
1     Suresh
2      Megha
3     Deepak
4    Pallavi
5      Rahul
6      Dhruv
7      Nidhi
Name: Name, dtype: object

In [500]:
codes

0    111
1    112
2    113
3    114
4    115
5    116
6    117
7    118
Name: ID, dtype: int64

In [502]:
age

0    24
1    26
2    27
3    21
4    28
5    25
6    21
7    26
Name: Age, dtype: int64

In [504]:
city

0         Pune
1    Bangalore
2        Delhi
3    Hyderabad
4      Chennai
5        Noida
6     Gurugram
7     Dehradun
Name: City, dtype: object

In [522]:
df=pd.DataFrame([name,codes,age,city]).T

In [524]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

### Using a dictionary

In [527]:
# - The keys from the dictionary become the column names.
# - The list of values from the dictionary become the values.

In [529]:
name=['Jayanth', 'Suresh', 'Megha', 'Deepak', 'Pallavi', 'Rahul', 'Dhruv', 'Nidhi']
age=[24,26,27,21,28,25,21,26]
city=['Pune', 'Bangalore', 'Delhi', 'Hyderabad', 'Chennai','Noida', 'Gurugram', 'Dehradun']
codes=[111,112,113,114,115,116,117,118]

In [535]:
data={'Name':name,
     'ID':codes,
     'Age':age,
     'City':city}

In [537]:
print(data)

{'Name': ['Jayanth', 'Suresh', 'Megha', 'Deepak', 'Pallavi', 'Rahul', 'Dhruv', 'Nidhi'], 'ID': [111, 112, 113, 114, 115, 116, 117, 118], 'Age': [24, 26, 27, 21, 28, 25, 21, 26], 'City': ['Pune', 'Bangalore', 'Delhi', 'Hyderabad', 'Chennai', 'Noida', 'Gurugram', 'Dehradun']}

In [541]:
df=pd.DataFrame(data)

In [543]:
df

      Name   ID  Age       City
0  Jayanth  111   24       Pune
1   Suresh  112   26  Bangalore
2    Megha  113   27      Delhi
3   Deepak  114   21  Hyderabad
4  Pallavi  115   28    Chennai
5    Rahul  116   25      Noida
6    Dhruv  117   21   Gurugram
7    Nidhi  118   26   Dehradun

In [545]:
# - While creating a dataframe using a dictionary we can change the order of columns or can add new columns.

In [549]:
pd.DataFrame(data,columns=['ID','Name','Age','City'])

    ID     Name  Age       City
0  111  Jayanth   24       Pune
1  112   Suresh   26  Bangalore
2  113    Megha   27      Delhi
3  114   Deepak   21  Hyderabad
4  115  Pallavi   28    Chennai
5  116    Rahul   25      Noida
6  117    Dhruv   21   Gurugram
7  118    Nidhi   26   Dehradun

In [555]:
df=pd.DataFrame(data,columns=['ID','Name','Age','City','Salary','Department'])

In [557]:
df

    ID     Name  Age       City Salary Department
0  111  Jayanth   24       Pune    NaN        NaN
1  112   Suresh   26  Bangalore    NaN        NaN
2  113    Megha   27      Delhi    NaN        NaN
3  114   Deepak   21  Hyderabad    NaN        NaN
4  115  Pallavi   28    Chennai    NaN        NaN
5  116    Rahul   25      Noida    NaN        NaN
6  117    Dhruv   21   Gurugram    NaN        NaN
7  118    Nidhi   26   Dehradun    NaN        NaN

In [559]:
data

{'Name': ['Jayanth',
  'Suresh',
  'Megha',
  'Deepak',
  'Pallavi',
  'Rahul',
  'Dhruv',
  'Nidhi'],
 'ID': [111, 112, 113, 114, 115, 116, 117, 118],
 'Age': [24, 26, 27, 21, 28, 25, 21, 26],
 'City': ['Pune',
  'Bangalore',
  'Delhi',
  'Hyderabad',
  'Chennai',
  'Noida',
  'Gurugram',
  'Dehradun']}

# Attributes on a dataframe

### shape

In [567]:
# - In case of a dataframe, it returns a tuple of two elements.
# - The elements represents the rows and the second element represtents the columns.

In [569]:
df

    ID     Name  Age       City Salary Department
0  111  Jayanth   24       Pune    NaN        NaN
1  112   Suresh   26  Bangalore    NaN        NaN
2  113    Megha   27      Delhi    NaN        NaN
3  114   Deepak   21  Hyderabad    NaN        NaN
4  115  Pallavi   28    Chennai    NaN        NaN
5  116    Rahul   25      Noida    NaN        NaN
6  117    Dhruv   21   Gurugram    NaN        NaN
7  118    Nidhi   26   Dehradun    NaN        NaN

In [571]:
df.shape

(8, 6)

### size

In [579]:
# - It returns the number of elements in a dataframe.
# - size=rows*cols

In [581]:
df.size

48

### Length of a dataframe

In [584]:
# - The number of rows is the length of the dataframe.
# - len(df)- It returns the length of the dataframe.

In [586]:
len(df)

8

### ndim

In [589]:
# - It returns the dimension of a dataframe.

In [591]:
df.ndim

2

### index

In [594]:
# - In case of implicit indexes, It returns the RangeIndex object that contains start, stop and step
# - In case of explicit indexes, It returns the Index object that contains the list of explicit indexes.

In [596]:
df

    ID     Name  Age       City Salary Department
0  111  Jayanth   24       Pune    NaN        NaN
1  112   Suresh   26  Bangalore    NaN        NaN
2  113    Megha   27      Delhi    NaN        NaN
3  114   Deepak   21  Hyderabad    NaN        NaN
4  115  Pallavi   28    Chennai    NaN        NaN
5  116    Rahul   25      Noida    NaN        NaN
6  117    Dhruv   21   Gurugram    NaN        NaN
7  118    Nidhi   26   Dehradun    NaN        NaN

In [598]:
df.index

RangeIndex(start=0, stop=8, step=1)

In [600]:
df.index=list('abcdefgh')

In [602]:
df

    ID     Name  Age       City Salary Department
a  111  Jayanth   24       Pune    NaN        NaN
b  112   Suresh   26  Bangalore    NaN        NaN
c  113    Megha   27      Delhi    NaN        NaN
d  114   Deepak   21  Hyderabad    NaN        NaN
e  115  Pallavi   28    Chennai    NaN        NaN
f  116    Rahul   25      Noida    NaN        NaN
g  117    Dhruv   21   Gurugram    NaN        NaN
h  118    Nidhi   26   Dehradun    NaN        NaN

In [604]:
df.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'], dtype='object')

### columns

In [607]:
# - It returns the RangeIndex object for the default column indexes.
# - It returns the Index object that contains the list of the explicit column indexes.

In [615]:
df=pd.DataFrame([name,codes,age,city]).T

In [617]:
df

         0    1   2          3
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [619]:
df.columns

RangeIndex(start=0, stop=4, step=1)

In [621]:
df.columns=['Name','ID', 'Age', 'City']

In [623]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [625]:
df.columns

Index(['Name', 'ID', 'Age', 'City'], dtype='object')

### values

In [628]:
# - It returns a 2D array that contains the values from a dataframe.

In [630]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [632]:
df.values

array([['Jayanth', 111, 24, 'Pune'],
       ['Suresh', 112, 26, 'Bangalore'],
       ['Megha', 113, 27, 'Delhi'],
       ['Deepak', 114, 21, 'Hyderabad'],
       ['Pallavi', 115, 28, 'Chennai'],
       ['Rahul', 116, 25, 'Noida'],
       ['Dhruv', 117, 21, 'Gurugram'],
       ['Nidhi', 118, 26, 'Dehradun']], dtype=object)

# Indexing and Slicing of a dataframe

### Indexing

In [634]:
# - A dataframe may have implicit or explicit indexes.

#### In case of implicit indexes

In [639]:
# df.iloc[row_index]
# df.iloc[row_index,col_index]

#### In case of the explicit indexes

In [644]:
# df.loc[row_index]
# df.loc[row_index,col_index]

In [646]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [648]:
# First row

In [650]:
df.iloc[0]

Name    Jayanth
ID          111
Age          24
City       Pune
Name: 0, dtype: object

In [652]:
df.iloc[[0]]

      Name   ID Age  City
0  Jayanth  111  24  Pune

In [654]:
# Last row

In [656]:
df.iloc[-1]

Name       Nidhi
ID           118
Age           26
City    Dehradun
Name: 7, dtype: object

In [658]:
df.iloc[[-1]]

    Name   ID Age      City
7  Nidhi  118  26  Dehradun

In [660]:
df.iloc[-1:]

    Name   ID Age      City
7  Nidhi  118  26  Dehradun

In [662]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [668]:
# Fetch Suresh

df.iloc[1,0]

'Suresh'

In [674]:
df.loc[1,'Name']

'Suresh'

In [688]:
# Get the city from row 6

In [692]:
df.loc[6,'City']

'Gurugram'

In [694]:
df.index=list('abcdefgh')

In [698]:
df

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

In [706]:
# Give the city available at f

df.loc['f','City']

'Noida'

In [708]:
# Last row

In [712]:
df.iloc[-1:]

    Name   ID Age      City
h  Nidhi  118  26  Dehradun

In [716]:
df.loc['h':]

    Name   ID Age      City
h  Nidhi  118  26  Dehradun

In [722]:
# Last city
df.iloc[-1,-1]

'Dehradun'

In [726]:
df.loc['h','City']

'Dehradun'

In [735]:
df

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

In [737]:
# Fetch Chennai
df.loc['e','City']

'Chennai'

In [739]:
df.iloc[4,-1]

'Chennai'

In [745]:
# First row
df.iloc[[-len(df)]]

      Name   ID Age  City
a  Jayanth  111  24  Pune

In [749]:
# Last element

df.iloc[len(df)-1:]

    Name   ID Age      City
h  Nidhi  118  26  Dehradun

### Slicing

In [752]:
# df.iloc[row_slicing]
# df.iloc[start:stop:step]
# df.iloc[row_slicing,col_slicing]
# df.iloc[start:stop:step,start:stop:step]

# stop is included in the following (Note)
# df.loc[row_slicing]
# df.loc[start:stop:step]
# df.loc[row_slicing,col_slicing]
# df.loc[start:stop:step,start:stop:step]

In [754]:
df=pd.DataFrame([name,codes,age,city]).T

In [756]:
df.columns=['Name','ID','Age','City']

In [758]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [760]:
# First three rows

In [762]:
df.iloc[0:3]

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi

In [764]:
df.iloc[0:3:1]

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi

In [766]:
# Reverse the dataframe

In [768]:
df.iloc[::-1]

      Name   ID Age       City
7    Nidhi  118  26   Dehradun
6    Dhruv  117  21   Gurugram
5    Rahul  116  25      Noida
4  Pallavi  115  28    Chennai
3   Deepak  114  21  Hyderabad
2    Megha  113  27      Delhi
1   Suresh  112  26  Bangalore
0  Jayanth  111  24       Pune

In [770]:
# Names of the first three rows

In [776]:
df.iloc[0:3,[0]]

      Name
0  Jayanth
1   Suresh
2    Megha

In [784]:
df.loc[0:3,['Name']]

      Name
0  Jayanth
1   Suresh
2    Megha
3   Deepak

In [786]:
# First four rows and the first two columns

In [790]:
df.iloc[0:4,0:2]

      Name   ID
0  Jayanth  111
1   Suresh  112
2    Megha  113
3   Deepak  114

In [794]:
df

      Name   ID Age       City
0  Jayanth  111  24       Pune
1   Suresh  112  26  Bangalore
2    Megha  113  27      Delhi
3   Deepak  114  21  Hyderabad
4  Pallavi  115  28    Chennai
5    Rahul  116  25      Noida
6    Dhruv  117  21   Gurugram
7    Nidhi  118  26   Dehradun

In [792]:
# Name and City columns for the first four rows

In [800]:
df.iloc[0:4,::3]

      Name       City
0  Jayanth       Pune
1   Suresh  Bangalore
2    Megha      Delhi
3   Deepak  Hyderabad

In [802]:
# Reverse the columns

In [804]:
df.iloc[::,::-1]

        City Age   ID     Name
0       Pune  24  111  Jayanth
1  Bangalore  26  112   Suresh
2      Delhi  27  113    Megha
3  Hyderabad  21  114   Deepak
4    Chennai  28  115  Pallavi
5      Noida  25  116    Rahul
6   Gurugram  21  117    Dhruv
7   Dehradun  26  118    Nidhi

In [806]:
# Reverse the rows and the columns both.

In [808]:
df.iloc[::-1,::-1]

        City Age   ID     Name
7   Dehradun  26  118    Nidhi
6   Gurugram  21  117    Dhruv
5      Noida  25  116    Rahul
4    Chennai  28  115  Pallavi
3  Hyderabad  21  114   Deepak
2      Delhi  27  113    Megha
1  Bangalore  26  112   Suresh
0       Pune  24  111  Jayanth

In [810]:
df.index=list('abcdefgh')

In [812]:
df

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

In [814]:
# First three rows

In [816]:
df.iloc[0:3]

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi

In [818]:
df.loc['a':'c']

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi

In [820]:
# Name of the first four rows

In [824]:
df.iloc[0:4,[0]]

      Name
a  Jayanth
b   Suresh
c    Megha
d   Deepak

In [828]:
df.loc['a':'d',['Name']]

      Name
a  Jayanth
b   Suresh
c    Megha
d   Deepak

In [832]:
# df.loc[0:4,'Name']

In [834]:
# Give the details from d to h

In [836]:
df.loc['d':'h']

      Name   ID Age       City
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

In [838]:
# Give the details from d to h and Name to Age

In [844]:
df.loc['d':'h','Name':'City']

      Name   ID Age       City
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

# Accessing a column or columns

In [847]:
# df.col_name -> series
# df['col_name'] -> series
# df.loc[::,'col_name'] -> series

In [849]:
df

      Name   ID Age       City
a  Jayanth  111  24       Pune
b   Suresh  112  26  Bangalore
c    Megha  113  27      Delhi
d   Deepak  114  21  Hyderabad
e  Pallavi  115  28    Chennai
f    Rahul  116  25      Noida
g    Dhruv  117  21   Gurugram
h    Nidhi  118  26   Dehradun

In [851]:
# Extract Name column

In [853]:
df.iloc[::,0]

a    Jayanth
b     Suresh
c      Megha
d     Deepak
e    Pallavi
f      Rahul
g      Dhruv
h      Nidhi
Name: Name, dtype: object

In [855]:
df.iloc[::,[0]]

      Name
a  Jayanth
b   Suresh
c    Megha
d   Deepak
e  Pallavi
f    Rahul
g    Dhruv
h    Nidhi

In [859]:
df.loc[::,['Name']]

      Name
a  Jayanth
b   Suresh
c    Megha
d   Deepak
e  Pallavi
f    Rahul
g    Dhruv
h    Nidhi

In [861]:
df.Name

a    Jayanth
b     Suresh
c      Megha
d     Deepak
e    Pallavi
f      Rahul
g      Dhruv
h      Nidhi
Name: Name, dtype: object

In [863]:
df['Name']

a    Jayanth
b     Suresh
c      Megha
d     Deepak
e    Pallavi
f      Rahul
g      Dhruv
h      Nidhi
Name: Name, dtype: object

In [865]:
df[['Name']]

      Name
a  Jayanth
b   Suresh
c    Megha
d   Deepak
e  Pallavi
f    Rahul
g    Dhruv
h    Nidhi

In [867]:
# Extract Name and Age

In [869]:
df[['Name','Age']]

      Name Age
a  Jayanth  24
b   Suresh  26
c    Megha  27
d   Deepak  21
e  Pallavi  28
f    Rahul  25
g    Dhruv  21
h    Nidhi  26

In [871]:
df[['Age','Name']]

  Age     Name
a  24  Jayanth
b  26   Suresh
c  27    Megha
d  21   Deepak
e  28  Pallavi
f  25    Rahul
g  21    Dhruv
h  26    Nidhi

In [873]:
df[['ID','Name','City']]

    ID     Name       City
a  111  Jayanth       Pune
b  112   Suresh  Bangalore
c  113    Megha      Delhi
d  114   Deepak  Hyderabad
e  115  Pallavi    Chennai
f  116    Rahul      Noida
g  117    Dhruv   Gurugram
h  118    Nidhi   Dehradun

# How to modify the values in a dataframe